#include <stdio.h>




//统计二进制中1的个数（讲过）


//有问题的代码
//a*b + c*d + e*f
//优先级只能保证前两个*比+早计算，而第三个*不一定比第一个+先执行
//如果a,b,c,d,e,f为常数结果都一样，但如果是表达式就有潜在的bug
//再来：
//c + --c;
//再来：
//i = i-- - --i * ( i = -3 ) * i++ + ++i;


//操作符的属性：优先级，运算顺序，运算控制


//类型转换（显式隐式）
//显式：在要转换的数据前加上(类型)即可
//
//隐式：整型提升（长度低于int的整型参与计算，符号位会向左延长至int长度），因为CPU内的ALU长度一般为int长度
//		算术转换（操作数的类型不匹配，要先把精度小的向大的转换，可能精度丢失）
//
//int main()
//{
//	char a = 3;
//	char b = 127;
//	char c = a + b;//a和b如何相加？先整型提升送进CPU计算，计算完再截断为原来的长度
//	
//	printf("%d", c);
//	return 0;
//}


//成员变量操作符. ->

//函数调用操作符()

//,从左向右依次执行，以最后一个表达式的结果为最后的结果
//可用于while等

//&&左边为假则右边就不管了，反正结果为假
//||左边为真则右边就不管了，反正结果为真

//~
//
//int main()
//{
//	int a = 11;
//	//将a的二进制数的第三位改为1
//	a |= (1<<2);
//	printf("%d\n", a);
//	//将a的二进制数的第三位改为0
//	a &= ~(1<<2);
//	printf("%d\n", a);
//	
//	return 0;
//}


//求一个整数存储在内存中的二进制数有几个1
//
//int main()
//{
//	int a = 128;
//	int count = 0;//计数
////	法一(只能算正数，要想算负数要unsigned)
////	while(a)
////	{
////		if(a%2 == 1)
////		{
////			count++;
////		}
////		a /= 2;
////	}
////	法二(正常能想到)
////	int i = 0;
////	for(i = 0; i<32; i++)	//也可能是i<64
////	{
////		if((a>>i)&1)
////		{
////			count++;
////		}
////	}
////	法三(头皮发麻，震惊！！)
//	while(a)
//	{
//		a &= a-1;			//负数法二和法三一样，正数法三更快；还不用考虑i<32还是i<64
//		count++;
//	}
//	
//	printf("%d", count);
//	return 0;
//}


//有这样的特点：a^a == 0, a^0 == a, a&a == a, a|a == a, a|0 == a, 
//				a &= a-1(把二进制数最右边的1改为0)

//交换两个变量
//
//int main()
//{
//	//算法一（借助第三个变量）
//	/*
//	int a = 3;
//	int b = 5;
//	int c = 0;
//	
//	a = b;
//	b = c;
//	c = a;
//	*/
//	//算法二
//	/*
//	int a = 3;
//	int b = 5;
//	
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	*/
//	//算法三
//	int a = 3;
//	int b = 5;
//	
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	return 0;
//}


//%左边是正数则结果是正数，左边是负数则结果是负数
//%只能用于整数运算

//整数的二进制表示形式：原码 反码 补码
//内存存储的是补码
//正数的原码，反码和补码是同一个。负数则是~原码==反码(不改变符号位） ，反码 + 1 == 补码

//>>右边丢弃，左边补符号（算数右移）

//sizeof里面的运算无效
//C标准规定sizeof返回值为unsigned
//
//int i;
//int main()
//{
//	i--;
//	if(i > sizeof(i)) printf(">\n");
//	else printf("<\n");				//结果是>。int和unsigned比较，int整型提升为unsigned。神不神奇？
//	
//	return 0;
//}
